Hi @unacceptable thanks for this issue!

Sometimes we made some attribute with a validation of non-empty to make this attribute to be different between absence and explicitly assigned with zero values. While in most circumstances, terraform handles the absence as zero values internally, but they semantically different. Therefore I suppose we cannot change this just for this case.

On the other hand, you could assign the `health_probe_id` to `null` instead of `""`, like this:
```hcl
resource "azurerm_linux_virtual_machine_scale_set" "main" {
  name                            = "${var.prefix}-vmss"
  resource_group_name             = azurerm_resource_group.main.name
  location                        = azurerm_resource_group.main.location
  sku                             = "Standard_F2"
  instances                       = 3
  admin_username                  = "adminuser"
  admin_password                  = "P@ssw0rd1234!"
  disable_password_authentication = false
  health_probe_id                 = length(var.flag) > 0 ? null : azurerm_lb_probe.main.id
  upgrade_mode                    = length(var.flag) > 0 ? "Manual" : "Rolling"

  dynamic rolling_upgrade_policy {
    for_each = length(var.flag) > 0 ? [] : [1]
    content {
      max_batch_instance_percent              = 21
      max_unhealthy_instance_percent          = 22
      max_unhealthy_upgraded_instance_percent = 23
      pause_time_between_batches              = "PT30S"
    }
  }

  source_image_reference {
    publisher = "Canonical"
    offer     = "UbuntuServer"
    sku       = "16.04-LTS"
    version   = "latest"
  }

  os_disk {
    storage_account_type = "Standard_LRS"
    caching              = "ReadWrite"
  }

  network_interface {
    name    = "example"
    primary = true

    ip_configuration {
      name                                   = "internal"
      primary                                = true
      subnet_id                              = azurerm_subnet.internal.id
      load_balancer_backend_address_pool_ids = [azurerm_lb_backend_address_pool.main.id]
      load_balancer_inbound_nat_rules_ids    = [azurerm_lb_nat_pool.main.id]
    }
  }

  depends_on = [azurerm_lb_rule.main]
}
```
After a plan with `var.flag=test`, I get the following plan:
```
# azurerm_linux_virtual_machine_scale_set.main will be created
  + resource "azurerm_linux_virtual_machine_scale_set" "main" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = "adminuser"
      + computer_name_prefix                              = (known after apply)
      + disable_password_authentication                   = false
      + do_not_run_extensions_on_overprovisioned_machines = false
      + id                                                = (known after apply)
      + instances                                         = 3
      + location                                          = "eastus2"
      + max_bid_price                                     = -1
      + name                                              = "test-vmss"
      + overprovision                                     = true
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "test-resources"
      + scale_in_policy                                   = "Default"
      + single_placement_group                            = true
      + sku                                               = "Standard_F2"
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Manual"
      + zone_balance                                      = false

      + automatic_instance_repair {
          + enabled      = (known after apply)
          + grace_period = (known after apply)
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "example"
          + primary                       = true

          + ip_configuration {
              + load_balancer_backend_address_pool_ids = (known after apply)
              + load_balancer_inbound_nat_rules_ids    = (known after apply)
              + name                                   = "internal"
              + primary                                = true
              + subnet_id                              = (known after apply)
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "16.04-LTS"
          + version   = "latest"
        }

      + terminate_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }
```
As you can see, it does not have a `health_probe_id` attribute and it should pass the validation.